from django.core.management.base import BaseCommand
from django.core.management import CommandError, call_command
from django.contrib.contenttypes.models import ContentType


TCK = ["Волинський ОТЦК та СП",
"Закарпатський ОТЦК та СП",
"Берегівський РТЦК та СП",
"Хустський РТЦК та СП",
"Мукачівський РТЦК та СП",
"Рахівський РТЦК та СП",
"Ужгородський РТЦК та СП",
"Тячівський РТЦК та СП",
"Івано-Франківський ОТЦК та СП",
"Львівський ОТЦК та СП, 79005",
"Рівненський ОТЦК та СП",
"Тернопільський ОТЦК та СП",
"Хмельницький ОТЦК та СП",
"Чернівецький ОТЦК та СП",
"Дніпропетровський обласний територіальний центр комплектування та соціальної підтримки",
"Амур-Нижньодніпровський районний територіальний центр комплектування та соціальної підтримки",
"Шевченківський районний територіальний центр комплектування та соціальної підтримки",
"Дніпровський районний територіальний центр комплектування та соціальної підтримки",
"1-й відділ Дніпровського районного територіального центру комплектування та соціальної підтримки",
"2-й відділ Дніпровського районного територіального центру комплектування та соціальної підтримки",
"3-й відділ Дніпровського районного територіального центру комплектування та соціальної підтримки",
"Соборний районний територіальний центр комплектування та соціальної підтримки",
"Індустріальний районний територіальний центр комплектування та соціальної підтримки",
"Центрально-Чечелівський об’єднаний районний територіальний центр комплектування та соціальної підтримки",
"Новокодацький районний територіальний центр комплектування та соціальної підтримки",
"Самарський районний територіальний центр комплектування та соціальної підтримки",
"Новомосковський районний територіальний центр комплектування та соціальної підтримки ",
"1-й відділ Новомосковського районного територіального центру комплектування та соціальної підтримки",
"Криворізький районний територіальний центр комплектування та соціальної підтримки",
"1-й відділ Криворізьського районного територіального центру комплектування та соціальної підтримки",
"2-й відділ Криворізьського районного територіального центру комплектування та соціальної підтримки ",
"3-й відділ Криворізьського районного територіального центру комплектування та соціальної підтримки",
"Покрово-Тернівський об’єднаний районний територіальнийцентр комплектування та соціальної підтримки",
"Інгулецький об’єднаний районний територіальний центр комплектування та соціальної підтримки",
"Саксаганський районний територіальний центр комплектування та соціальної підтримки",
"Центрально-Міський районний територіальний центр комплектування та соціальної підтримки",
"Металургійо-Довгінцевський об’єднаний районний територіальний центр комплектування та соціальної підтримки",
"Кам’янський районний територіальний територіальний центр комплектування та соціальної підтримки",
"1-й відділ Кам’янського районного територіального центру комплектування та соціальної підтримки",
"2-й відділ Кам’янського районного територіального центру комплектування та соціальної підтримки",
"3-й відділ Кам’янського районного територіального центру комплектування та соціальної підтримки",
"4-й відділ Кам’янського районного територіального центру комплектування та соціальної підтримки",
"Нікопольський районний територіальний центр комплектування та соціальної підтримки",
"1-й відділ Нікопольського районного територіального центру комплектування та соціальної підтримки",
"2-й відділ Нікопольського районного територіального центру комплектування та соціальної підтримки",
"3-й відділ Нікопольського районного територіального центру комплектування та соціальної підтримки",
"Апостолівський районний територіальний центр комплектування та соціальної підтримки",
"Павлоградський районний територіальний центр комплектування та соціальної підтримки",
"Синельниківський районний територіальний центр комплектування та соціальної підтримки",
"1-й відділ  Синельниківського районного територіального центру комплектування та соціальної підтримки",
"2-й відділ  Синельниківського районного територіального центру комплектування та соціальної підтримки",
"3-й відділ  Синельниківського районного територіального  центру комплектування та соціальної підтримки",
"4-й відділ  Синельниківського районного територіального  центру комплектування та соціальної підтримки",
"5-й відділ  Синельниківського районного територіального центру комплектування та соціальної підтримки",
"Донецький обласний територіальний центр комплектування та соціальної підтримки",
"Запорізький ОЦТК та СП",
"Луганський обласний територіальний центр комплектуваннята соціальної підтримки",
"Щастинський РТЦК та СП",
"Сватівський РТЦК та СП",
"Сєвєродонецький РТЦК та СП",
"Старобільський РТЦК та СП",
"Харківський обласний територіальний центр комплектування та соціальної підтримки",
"Житомирський ОТЦК та СП",
"Житомирський ОМТЦК та СП",
"Житомирський РТЦК та СП",
"Коростенський РТЦК та СП",
"Бердичівський РТЦК та СП",
"Новоград-Волинський РТЦК та СП",
"Київський міський територіальний центр комплектування та соціальної підтримки ",
"Голосіївський районний в місті Києві ТЦК та СП",
"Дарницький районний в місті Києві ТЦК та СП",
"Деснянський районний в місті Києві ТЦК та СП",
"Дніпровський районний в місті Києві ТЦК та СП",
"Оболонський районний в місті Києві ТЦК та СП",
"Печерський районний в місті Києві ТЦК та СП",
"Подільський районний в місті Києві ТЦК та СП",
"Святошинський районний в місті Києві ТЦК та СП",
"Солом’янський районний в місті Києві ТЦК та СП",
"Шевченківський районний в місті Києві ТЦК та СП",
"Збірний пункт Київського міського ТЦК та СП",
"Київський ОТЦК та СП",
"Білоцерківський РТЦК СП",
"Бориспільський РТЦК СП",
"Броварський РТЦК СП",
"Бучанський РТЦК СП",
"Вишгородський РТЦК СП",
"Обухівський РТЦК СП",
"Фастівський РТЦК СП",
"Полтавський обласний територіальний центр комплектування та соціальної підтримки",
"Полтавський об'єданий міський територіальний центр комплектування та соціальної підтримки",
"Полтавський районний територіальний центр комплектуваня та соціальної підтримки",
"Кременчуцький районний територіальний центр комплектуваня та соціальної підтримки",
"Лубенський районний територіальний центр комплектуваня та соціальної підтримки",
"Миргородський районний територіальний центр комплектуваня та соціальної підтримки",
"Сумський ОТЦК та СП",
"Конотопський РТЦК та СП",
"Охтирський РТЦК та СП",
"Роменський РТЦК та СП",
"Сумський ОМТЦК та СП",
"Сумський РТЦК та СП",
"Шосткинський РТЦК та СП",
"Черкаський ОТЦК та СП",
"Відділ №1 (м. Городище) Черкаського районного територіального центру комплектування та соціальної підтримки",
"Відділ №2 (смт. Драбів) Золотоніського районного територіального центру комплектування та соціальної підтримки",
"Відділ №2 (м. Жашків) Уманського районного територіального центру комплектування та соціальної підтримки",
"Звенигородський РТЦК та СП",
"Золотоніський районний територіальний центр комплектування та соціальної підтримки",
"Відділ №5 (м. Кам’янка) Черкаського районного територіального центру комплектування та соціальної підтримки",
"Відділ №2 (м. Канів) Черкаського районного територіального центру комплектування та соціальної підтримки",
"Відділ №4 (смт. Катеринопіль) Звенигородського районного територіального центру комплектування та соціальної підтримки",
"Відділ №3 (м. Корсунь-Шевченківський) Черкаського районного територіального центру комплектування та соціальної підтримки",
"Відділ №2 (смт. Лисянка) Звенигородського районного територіального центру комплектування та соціальної підтримки",
"Відділ №3 (смт. Маньківка) Уманського районного територіального центру комплектування та соціальної підтримки",
"Відділ №4 (м. Монастирище) Уманського районного територіального центру комплектування та соціальної підтримки",
"Черкаський районний територіальний центр комплектування та соціальноїпідтримки (м. Сміла)",
"Відділ №3 (м. Тальне) Звенигородського районного територіального центру комплектування та соціальної підтримки",
"Уманський районний територіальний центр комплектування та соціальної підтримки",
"Відділ №1 (м. Христинівка) Уманського районного територіального центру комплектування та соціальної підтримки",
"Черкаський міський територіальний центр комплектування та соціальної підтримки",
"Відділ №4 (м. Чигирин)Черкаського районного територіального центру комплектування та соціальної підтримки",
"Відділ №1 (смт. Чорнобай) Золотоніського районного територіального центру комплектування та соціальної підтримки",
"Відділ №1 (м. Шпола) Звенигородського районного територіального центру комплектування та соціальної підтримки",
"Чернігівський ОТЦК та СП",
"Корюківський РТЦК та СП",
"Перше відділення Корюківського РТЦК та СП",
"Друге відділення Корюківського РТЦК та СП",
"Трете відділення Корюківського РТЦК та СП",
"Ніжинський РТЦК та СП",
"Перше відділення Ніжинського РТЦК та СП",
"Друге відділення Ніжинського РТЦК та СП",
"Трете відділення Ніжинського РТЦК та СП",
"Четверте відділення Ніжинського РТЦК та СП",
"Новгород-Сіверський РТЦК та СП",
"Перше відділення Новгород-Сіверського РТЦК та СП",
"Друге відділення Новгород-Сіверського РТЦК та СП",
"Прилуцький РТЦК та СП",
"Перше відділення Прилуцького РТЦК та СП",
"Друге відділення Прилуцького РТЦК та СП",
"Трете відділення Прилуцького РТЦК та СП",
"Чернігівське РТЦК та СП",
"Перше відділення Чернігівського РТЦК та СП",
"Друге відділення Чернігівського РТЦК та СП",
"Трете відділення Чернігівського РТЦК та СП",
"Четверте відділення Чернігівського РТЦК та СП",
"Чернігівський МТЦК та СП",
"Миколаївський ОТЦК та СП",
"Херсонський ОТЦК та СП",
"Бериславський  РТЦК та СП",
"Нововоронцовський відділ Бериславського  РТЦК та СП",
"Великоолександрівський відділ Бериславського  РТЦК та СП",
"Генічеський РТЦК та СП",
"Нижньосірогозський відділ Генічеського  РТЦК та СП",
"Новотроїцький відділ Генічеського  РТЦК та СП",
"Каховський РТЦК та СП",
"Великолепетиський відділ Каховського  РТЦК та СП",
"Каховський відділ Каховського  РТЦК та СП",
"Чаплинський відділ Каховського  РТЦК та СП",
"Горностаєвський відділ Каховського  РТЦК та СП",
"Скадовський РТЦК та СП",
"Голопристанський відділ Скадовського   РТЦК та СП",
"Каланчацький відділ Скадовського   РТЦК та СП",
"Херсонський РТЦК та СП",
"Білозерський  відділ Херсонського   РТЦК та СП",
"Олешківський відділ Херсонського   РТЦК та СП",
"Одеський ОТЦК та СП",
"Вінницький ОТЦК та СП",
"Центральний РТЦК та СП",
"Заводський РТЦК та СП",
"Інгульський РТЦК та СП",
"Корабельний РТЦК та СП",
"Первомайський РТЦК та СП",
"Баштанський РТЦК та СП",
"Вознесенський РТЦК та СП",
"Миколаївький РТЦК та СП",
"Кіровоградський ОТЦК та СП"]

SPC = {"003":"Оперативно-тактичних ракет",
"004":"Зенітних ракет",
"007":"Крилатих ракет",
"008":"Протичовнових ракет",

"0015":"Оперативно-тактичних ракет",
"0016":"Тактичних ракет",
"0019":"Зенітних ракет",
"0020":"Крилатих ракет",
"0021":"Протичовнових ракет",

"0028":"Оперативно-тактичних ракет",
"0029":"Тактичних ракет",
"0033":"Зенітних ракет дальньої дії",
"0034":"Зенітних ракет середньої дії",
"0035":"Зенітних ракет малої дії",
"0036":"Зенітних ракет малої дії (автономних комплексів)",
"0037":"Зенітних ракет ближньої дії",
"0038":"Крилатих ракет",
"0039":"Протичовнових ракет",
"0040":"Монтажного і такелажного устаткування",

"0047":"Оперативно-тактичних ракет",
"0048":"Тактичних ракет",
"0052":"Зенітних ракет дальньої дії",
"0053":"Зенітних ракет середньої дії",
"0054":"Зенітних ракет малої дії",
"0055":"Зенітних ракет малої дії (автономних комплексів)",
"0056":"Зенітних ракет ближньої дії",
"0057":"Крилатих ракет",
"0058":"Протичовнових ракет",
"0059":"Силових електричних агрегатів",

"0065":"Оперативно-тактичних ракет",
"0069":"Зенітних ракет дальньої дії",
"0070":"Зенітних ракет середньої дії",
"0071":"Зенітних ракет малої дії",
"0072":"Зенітних ракет малої дії (автономних комплексів)",
"0073":"Зенітних ракет ближньої дії",
"0074":"Крилатих ракет",
"0075":"Протичовнових ракет",

"0081":"Оперативно-тактичних ракет",
"0084":"Зенітних ракет",
"0085":"Крилатих ракет",
"0086":"Протичовнових ракет",


"00100":"Стрілецькі",
"00101":"Кулеметні",
"00102":"Гранатометні (автоматичних протипіхотних гранатометів)",
"00103":"Гранатометні (ручних протитанкових гранатометів)",
"00104":"Переносних зенітних ракетних комплексів",
"00105":"Оперативної розвідки",
"00106":"Військової розвідки",
"00107":"Розвідки (частин спеціального призначення, спеціальних операцій та мобільних підрозділів)",
"00108":"Спеціальної розвідки",
"00109":"Розвідувально-сигнальних комплексів",
"00110":"Снайперські",
"00111":"Прикордонної служби",

"00113":"Середніх танків",
"00116":"Танків з плавзасобами",
"00117":"Танків з ракетно-гарматним озброєнням",
"00118":"Важких та середніх самохідних артилерійських установок",

"00121":"Бойових машин піхоти",
"00122":"Бойових машин десанту",
"00123":"Гусеничних бронетранспортерів",
"00124":"Колісних бронетранспортерів",
"00125":"Бронетранспортерів десантних",
"00126":"Гусеничних розвідувальних машин",
"00127":"Мотоциклів",

"00132":"Самохідних гармат 203-мм",
"00133":"Гармат 152-мм",
"00134":"Самохідних гармат 152-мм",
"00135":"Гармат від 76-мм до 130-мм",
"00136":"Самохідних гармат від 76-мм до 130-мм",
"00137":"Протитанкових гармат",
"00139":"Протитанкових ракетних комплексів",
"00140":"Реактивної артилерії",
"00143":"Мінометів від 82-мм до 120-мм",
"00144":"Самохідних мінометів від 82-мм до 120-мм",
"00145":"Станкових гранатометів і безвідкатних гармат",
"00146":"Артилерійської розвідки",
"00147":"Засобів управління артилерійською стрільбою",
"00148":"Баштових артилерійських установок",
"00149":"Електрообладнання артилерійських систем",
"00153":"Зенітних гармат 100-мм і більше",
"00155":"Зенітних гармат 57-мм",
"00156":"Зенітних гармат до 57-мм",
"00157":"Зенітних самохідних установок з радіоприладним комплексом",
"00160":"Зенітних кулеметів",
"00161":"Розвідки",
"00162":"Засобів управління стрільбою",
"00163":"Зенітних гарматно-ракетних комплексів",

"00166":"Інженерно-саперні",
"00167":"Переправних засобів",
"00168":"Інженерної розвідки",
"00169":"Маскування",
"00170":"Мостобудівних засобів",
"00171":"Лісозаготівельних і лісопильних засобів",
"00172":"Водолазних робіт",
"00173":"Гідротехнічних споруд",
"00174":"Польового водопостачання",
"00175":"Плаваючих інженерних машин",
"00176":"Механізованих мостів",
"00177":"Мостоукладачів",
"00178":"Машин для загородження",
"00179":"Машин для розгородження та розмінування",
"00180":"Дорожніх машин",
"00181":"Рятувальних та аварійно-відновлювальних робіт",
"00182":"Піротехнічних робіт",
"00183":"Керованого мінування",
"00184":"Землерийних машин",
"00185":"Розмінування",

"00187":"Радіаційної, хімічної, біологічної розвідки та дозиметричного контролю",
"00188":"Розрахунково-аналітичних станцій",
"00189":"Засобів дегазації обмундирування та спорядження",
"00190":"Теплових засобів спеціальної обробки",
"00191":"Рідинних засобів спеціальної обробки",
"00192":"Термічних димових засобів",
"00193":"Вогнеметно-запалювальних засобів",
"00195":"Військ радіаційного, хімічного, біологічного (РХБ) захисту",
"00196":"Систем регенерації повітря та апаратури газового контролю",
"00197":"Радіометричного та хімічного аналізу",

"00200":"Пошуку потерпілих",
"00201":"Розвідки об`єктів у місцях ураження (руїни)",
"00202":"Робототехнічних засобів",
"00203":"Рятувальних робіт",


"00210":"Льотних екіпажів",
"00211":"Диспетчерської служби",
"00212":"Аеромобільної техніки",
"00213":"Систем десантування",
"00214":"Автоматичного обладнання та піротехнічних засобів десантування",
"00215":"Аеростатів",
"00216":"Зовнішніх екіпажів безпілотних авіаційних комплексів (безпілотних літальних апаратів)",

"00220":"Літаків з реактивними (турбовентиляторними) двигунами",
"00221":"Літаків з турбогвинтовими двигунами",
"00222":"Літаків з поршневими двигунами",
"00223":"Вертольотів з реактивними та турбогвинтовими двигунами",
"00224":"Вертольотів з поршневими двигунами",
"00225":"Безпілотних авіаційних комплексів та безпілотних літальних апаратів",
"00226":"Авіаційних крилатих ракет",
"00227":"Авіаційних протичовнових ракет",
"00228":"Порохових і рідинних реактивних двигунів",

"00233":"Бомбардувального й артилерійського озброєння та автоматів пасивних перешкод",
"00234":"Ракетного озброєння, систем наведення та управління ракетами",
"00235":"Прицільно-навігаційних комплексів і обчислювальної техніки",
"00236":"Засобів підготовки та контролю керованих ракет",
"00237":"Авіаційного протичовнового та мінно-торпедного озброєння",
"00238":"Десантно-транспортного та санітарного обладнання",
"00239":"Піротехнічних засобів",

"00244":"Бортової апаратури для засекречування та надшвидкодіючого зв`язку",
"00245":"Бортових радіолокаційних комплексів виявлення, наведення та цілевказання",
"00246":"Бортових радіотехнічних засобів виявлення цілей та наведення ракет",
"00247":"Бортових засобів радіоелектронної боротьби",
"00248":"Бортових радіоелектронних засобів розвідки",
"00249":"Бортових радіоелектронних комплексів і електронних обчислювальних машин",
"00250":"Радіозв`язкового обладнання літаків і вертольотів",
"00251":"Радіонавігаційного обладнання літаків і вертольотів",
"00252":"Радіоелектронної пошуково-прицільної протичовнової апаратури",
"00253":"Радіогідроакустичних скидних буїв",
"00254":"Радіоапаратури бомбометання та десантування",
"00255":"Радіоапаратури розпізнавання, оповіщення та активної відповіді",
"00256":"Радіотехнічного обладнання крилатих ракет і безпілотних літальних апаратів",

"00260":"Приладного обладнання літаків і вертольотів",
"00261":"Кисневого обладнання та засобів життєзабезпечення екіпажу",
"00262":"Електрообладнання літаків і вертольотів",
"00263":"Систем автоматизованого контролю",
"00264":"Авіаційних акумуляторних батарей",
"00265":"Бортових засобів реєстрації даних польоту",
"00266":"Комплексних тренажерів",
"00267":"Електронної автоматики та систем автоматизованого управління",
"00268":"Пілотажно-навігаційних комплексів",
"00269":"Фотообладнання, оптико-електронної та квантово-електронної техніки",
"00270":"Цільове навантаження безпілотних авіаційних комплексів (безпілотних літальних апаратів)",

"00273":"Приймання, оброблення та документування інформації радіотехнічної розвідки",
"00274":"Приймання, оброблення та документування інформації радіолокаційної розвідки",
"00275":"Приймання, оброблення та документування інформації телевізійної, оптико-електронної та квантово-електронної розвідки",
"00276":"Приймання, оброблення та документування інформації, отриманої від безпілотного літального апарата",

"00279":"Стартового та підйомно-транспортного обладнання безпілотних літальних апаратів",
"00280":"Аеродромно-експлуатаційних машин (установок)",
"00282":"Теплотехнічних засобів (станцій, установок)",
"00283":"Гідравлічних установок, електропневмогідроустановок та аеродромних пересувних електроагрегатів (систем)",
"00284":"Установок (станцій) для заправлення (зарядження) вогнегасною сумішшю",
"00285":"Світлотехнічного обладнання аеродромів",
"00286":"Авіаційних і аеродромних кондиціонерів",


"00300":"Кораблеводіння",
"00301":"Зорового зв`язку",
"00302":"Кораблеводіння та зорового зв`язку",
"00303":"Корабельного палубного обладнання, плавзасобів, рангоуту та його оснащення",
"00304":"Навігаційних комплексів з інерційними системами",
"00305":"Навігаційних комплексів безінерційних систем",
"00306":"Радіонавігаційних систем",
"00307":"Електронавігаційних приладів",
"00308":"Радіоастрономічних і астронавігаційних засобів",
"00309":"Електронавігаційних приладів катерів",
"00310":"Морської десантної підготовки",

"00320":"Мінного озброєння",
"00321":"Трального озброєння",
"00322":"Мінного електрообладнання",
"00323":"Трального електрообладнання",
"00324":"Реактивних протичовнових бомбових установок",
"00325":"Приладів управління бомбометанням",
"00326":"Корабельних засобів розмінування",

"00330":"Торпед парогазових",
"00331":"Торпед на сильних окислювачах",
"00332":"Електроторпед",
"00333":"Надводних кораблів",
"00334":"Контрольно-регулювальних засобів (станцій)",
"00335":"Торпедного електрообладнання",
"00336":"Приладів управління торпедною стрільбою",
"00337":"Підводних човнів",

"00340":"Гідроакустичних комплексів",
"00341":"Гідроакустичних станцій",
"00342":"Гідроакустичних засобів авіації",
"00343":"Гідроакустичних берегових засобів спостереження",
"00344":"Навігаційних гідроакустичних систем",
"00345":"Гідроакустичних станцій мінного пошуку",
"00346":"Гідроакустичної контрольно-вимірювальної апаратури",

"00350":"Комплексів підводного спостереження",
"00351":"Станцій підводного спостереження",
"00352":"Берегових засобів підводного спостереження",
"00353":"Авіаційних засобів підводного спостереження",
"00354":"Контрольно-вимірювальної апаратури засобів підводного спостереження",

"00360":"Парових турбін",
"00361":"Газових турбін",
"00362":"Котельних установок",
"00363":"Водопідготовки",
"00364":"Корабельних систем і пристроїв",
"00366":"Корабельного електрообладнання",
"00367":"Корабельних приладів управління та сигналізації",
"00368":"Двигунів внутрішнього згоряння",
"00369":"Дизель-генераторів",
"00370":"Торпедних і ракетних катерів",
"00371":"Двигунів, що працюють у замкнутому циклі",
"00373":"Кораблів і катерів на повітряній подушці",

"00379":"Водолазних робіт",
"00380":"Водолазних глибоководних робіт",
"00381":"Підводного мінування та робіт спеціального призначення",
"00382":"Водолазів-розвідників спеціального призначення",
"00383":"Водолазів-радистів спеціального призначення",
"00384":"Водолазів-радіометристів спеціального призначення",
"00385":"Підводних підривних робіт",
"00386":"Аварійно-рятувальних і суднопідйомних робіт",


"00403":"Телекомунікацій",
"00408":"Засобів механізації будівельних і монтажних робіт",

"00420":"Радіо- та супутникового зв`язку",
"00429":"Корабельних засобів радіозв`язку",
"00430":"Систем і комплексів радіозв`язку",
"00432":"Апаратури магнітного запису",

"00441":"Приймальних радіопристроїв, комплексів та засобів спеціального радіозв`язку великої та середньої потужності",
"00443":"Засобів спеціального радіозв`язку малої потужності",
"00446":"Радіоперехоплення, пеленгування та аналізу радіовипромінювання",

"00450":"Відкритого та засекреченого слухового зв`язку",
"00451":"Випромінювання засобів радіозв`язку",
"00452":"Радіорелейного, ультракороткохвильового та космічного зв`язку",
"00453":"Телеграфного літеродрукувального засекреченого радіозв`язку",
"00454":"Фототелеграфного, телевізійного та відеозв`язку",
"00455":"Спеціальних видів радіопередач",

"00460":"Радіорелейного та тропосферного зв`язку",

"00474":"Захисту інформації та кібернетичної безпеки в інформаційно-телекомунікаційних системах",
"00478":"Фототелеграфного",

"00485":"Фельд`єгерсько-поштового зв`язку",

"00500":"Радіолокаційних станцій (комплексів) метрового діапазону",
"00501":"Радіолокаційних станцій (комплексів) дециметрового діапазону",
"00502":"Радіолокаційних станцій (комплексів) сантиметрового діапазону",
"00503":"Радіолокаційних станцій (комплексів) спостереження за ближньою повітряною та надводною обстановкою",
"00504":"Радіолокаційних станцій (комплексів) спостереження за дальньою повітряною обстановкою",
"00505":"Технічних засобів бойових інформаційних постів",
"00506":"Штурманських радіолокаційних засобів",
"00507":"Радіовисотомірів",
"00508":"Радіотехнічних комплексних систем",

"00513":"Радіолокаційних станцій забезпечення гарматної наводки",
"00514":"Радіоприладних комплексів",
"00515":"Радіолокаційних станцій ракетних військ і артилерії",
"00516":"Радіотехнічних засобів наземної артилерії",
"00517":"Радіолокаційних станцій корабельної артилерії",
"00518":"Радіолокаційних станцій зенітної корабельної артилерії",
"00519":"Радіолокаційних станцій торпедної стрільби",
"00520":"Метеорологічних радіолокаційних станцій",

"00525":"Радіотехнічних систем і станцій посадки літаків",
"00526":"Радіотехнічних систем і станцій дальньої навігації",
"00527":"Радіотехнічних систем і станцій ближньої навігації",
"00528":"Привідних радіостанцій і радіомаркерів",
"00529":"Радіопеленгаторів короткохвильового діапазону",
"00530":"Радіопеленгаторів ультракороткохвильового та дециметрового діапазонів",
"00531":"Інструментальних систем посадки літаків",
"00532":"Навігаційно-зв`язкових космічних систем",
"00533":"Метеорологічних радіолокаційних станцій",

"00538":"Радіолокації",
"00539":"Ближньої радіонавігації",
"00540":"Радіопідривників",
"00541":"Оптико-електронних засобів",
"00542":"Гідроакустичних засобів",
"00543":"Комплексів автоматизованого управління радіотехнічними засобами перешкод",
"00544":"Засобів комплексного технічного контролю",
"00545":"Радіоелектронного подавлення безпілотних літальних апаратів",

"00549":"Короткохвильового радіозв`язку",
"00550":"Ультракороткохвильового радіозв`язку",
"00551":"Радіорелейного та тропосферного радіозв`язку",
"00552":"Дальньої радіонавігації",
"00553":"Космічного радіозв`язку",
"00554":"Комплексів автоматизованого управління засобами радіоперешкод",
"00555":"Тактичні системи радіорозвідки та пеленгування",

"00563":"Приймальних пристроїв систем попередження про ракетний напад",
"00564":"Передавальних пристроїв систем попередження про ракетний напад",

"00569":"Радіотехнічних засобів розвідки",

"00575":"Антенно-фідерних пристроїв",
"00576":"Пристроїв оброблення інформації",
"00577":"Апаратури реєстрування інформації",

"00582":"Телебачення",
"00583":"Відеозв`язку",
"00586":"Технічних засобів охоронної сигналізації та телебачення",


"00600":"Електронних обчислювальних машин",
"00601":"Адміністрування автоматизованої системи єдиного державного реєстру військовозобов`язаних",
"00602":"Лічильно-обчислювальних приладів",
"00603":"Бойових інформаційно-управляючих систем та відображення інформації",
"00604":"Лічильно-клавішних і лічильно-перфораційних машин",

"00611":"Ракетних комплексів",
"00612":"Зенітних ракетних комплексів",
"00614":"Систем попередження про ракетний напад",
"00615":"Командних пунктів",
"00616":"Пунктів управління",
"00617":"Зв`язку",
"00618":"Комплексів протичовнової оборони",
"00619":"Корабельних енергетичних установок і систем",
"00620":"Відображення, індикації та документування інформації",
"00621":"Приймання та передавання інформації",
"00622":"Комплексів засобів автоматизації автоматизованої системи управління авіацією та протиповітряною обороною",

"00626":"Далекомірів (візирів)",
"00627":"Звукометричних засобів",
"00628":"Оптичних засобів виміру та наводки",
"00629":"Світлотехнічних засобів виявлення та реєстрації ядерних вибухів",
"00630":"Геофізичних засобів виявлення та реєстрації ядерних вибухів",
"00631":"Метеорології (гідрометеорології)",
"00632":"Метеорологічної (гідрометеорологічної) техніки",
"00633":"Балістичних станцій",

"00638":"Радіотелеметричних станцій (комплексів)",
"00639":"Станції траєкторних вимірів",
"00640":"Станції командних радіоліній",
"00641":"Кінотеодолітних станцій",
"00642":"Антенних пристроїв радіотехнічних станцій (систем)",
"00643":"Апаратури системи єдиного часу",
"00644":"Радіотехнічних засобів виявлення та реєстрації ядерних вибухів",
"00645":"Систем попередження про ракетний напад",
"00646":"Приймально-вимірювальних і обчислювальних комплексів ракет і космічних апаратів",

"00651":"Електронної автоматики та телемеханіки",
"00652":"Оптико-електронної техніки",
"00653":"Квантово-електронної техніки",
"00654":"Оптико-електронних систем наведення ракет",

"00659":"Силових і освітлювальних агрегатів (станцій)",
"00660":"Трансформаторних підстанцій і розподільних пристроїв",
"00661":"Високовольтних мереж",
"00662":"Низьковольтних мереж",
"00664":"Релейного захисту і автоматики",
"00665":"Прожекторів",
"00666":"Електротехнічних засобів загороджень і сигналізації",
"00667":"Навчальних полів",

"00671":"Картографії",
"00672":"Топографії",
"00673":"Геодезії",
"00674":"Топогеодезії",
"00675":"Фотографії та фотообладнання",
"00676":"Фотограмметрії та дешифрування",
"00677":"Аерофотографічної служби",
"00678":"Фотоастрономії",
"00679":"Геоінформаційних технологій і систем",

"00682":"Гідрографії",
"00683":"Гідрології",
"00684":"Гравіметрії",
"00685":"Магнітометрії",
"00686":"Сейсмоакустики",


"00700":"Експлуатація та ремонт бронетанкової техніки",

"00702":"Підйомно-транспортного та заправного обладнання оперативно-тактичних ракет",
"00703":"Перевіряльно-пускового та електросилового обладнання оперативно-тактичних ракет",
"00704":"Наземного обладнання тактичних ракет",
"00705":"Наземного обладнання систем попередження про ракетний напад",
"00706":"Технічне забезпечення, експлуатація та ремонт ракетного озброєння і обладнання",
"00707":"Забезпечення авіаційно-технічним майном та засобами ураження",
"00713":"Експлуатація та ремонт ракетного, артилерійського, стрілецького озброєння і засобів ближнього бою",
"00718":"Зенітної самохідної артилерії",
"00719":"Корабельної та берегової артилерії",
"00720":"Топографічної техніки та майна",
"00721":"Приладів управління стрільбою",

"00725":"Зберігання та ремонт засобів ураження",
"00726":"Оперативно-тактичних ракет",
"00727":"Тактичних ракет",
"00732":"Протичовнових ракет",
"00736":"Протитанкових керованих ракет",
"00737":"Інженерних боєприпасів",

"00738":"Експлуатація та ремонт автомобільної техніки та її аналогів",
"00739":"Експлуатація та ремонт гусеничних тягачів і транспортерів",
"00740":"Експлуатація та ремонт тракторів",

"00741":"Протичовнового озброєння",
"00742":"Мінного та протимінного озброєння",
"00743":"Торпедного озброєння",
"00744":"Гідрографічно-штурманського озброєння",
"00745":"Навігаційних комплексів підводних човнів",
"00746":"Шкіперського майна",
"00747":"Технічного майна",
"00748":"Аварійно-рятувального майна",

"00752":"Радіолокаційних станцій і радіотехнічних засобів наземної артилерії",
"00753":"Радіолокаційних станцій гарматного наведення та радіоприладних комплексів зенітної артилерії",
"00754":"Експлуатація та ремонт радіотехнічних засобів наведення зенітних ракетних комплексів (систем)",
"00755":"Радіотехнічних засобів систем попередження про ракетний напад",
"00756":"Експлуатація та ремонт бортових приладів управління, контрольно-випробувального та технологічного устаткування зенітних ракетних комплексів (систем)",
"00758":"Авіаційних радіолокаційних станцій",
"00759":"Корабельних радіолокаційних станцій",
"00760":"Контрольно-вимірювальної апаратури",
"00761":"Радіотехнічних засобів виявлення та реєстрації ядерних вибухів",
"00762":"Радіотехнічних систем і станцій навігації та посадки літаків",
"00764":"Радіотехнічних засобів радіоелектронного подавлення",

"00766":"Забезпечення військ (сил) пальним та мастильними матеріалами",
"00767":"Транспортування, зберігання, розподіл пального, мастильних матеріалів та матеріально-технічних засобів служби пального, їх експлуатація і ремонт",

"00769":"З ремонту та зберігання засобів зв`язку",
"00776":"Телевізійної апаратури",
"00782":"Комплексів та засобів спеціального радіозв`язку",
"00784":"Контрольно-вимірювальної апаратури",
"00785":"Радіопеленгаторів, привідних радіостанцій і радіомаркерів",
"00786":"Радіоелектронної боротьби",

"00787":"Об`єднане матеріальне забезпечення",

"00788":"Продовольче забезпечення",

"00789":"Речове забезпечення",

"00790":"Перевезення автомобільним транспортом",

"00791":"Метрологічне забезпечення військ (сил)",

"00792":"Акумуляторних та зарядних пристроїв",

"00793":"Холодної обробки металу",
"00794":"Гарячої обробки металу",
"00795":"Зварювальних робіт",
"00796":"Гумових покриттів та вулканізації",
"00797":"Малярних робіт",
"00798":"Деревообробки",

"00799":"Газодобувних і зарядних станцій (установок) та газового аналізу й контролю",


"00800":"Корабельних гідроакустичних комплексів і станцій",
"00801":"Берегових гідроакустичних комплексів і станцій",
"00802":"Неакустичних засобів підводного спостереження",
"00803":"Апаратури та обладнання автоматизованих систем управління",
"00805":"Оптико-електронної техніки",
"00806":"Квантово-електронної техніки",
"00807":"Енергетичного і електротехнічного обладнання засобів протиповітряної оборони та систем попередження про ракетний напад",
"00808":"Світлотехнічних засобів виявлення та реєстрації ядерних вибухів",
"00809":"Геофізичних засобів виявлення та реєстрації ядерних вибухів",

"00815":"Засобів вимірювальної техніки теплотехнічних величин",
"00816":"Засобів вимірювальної техніки механічних величин",
"00817":"Засобів вимірювальної техніки гідроакустичних і звукометричних величин",
"00818":"Засобів вимірювальної техніки іонізуючого випромінювання",
"00819":"Засобів вимірювальної техніки оптичних світлотехнічних величин та параметрів лазерного випромінювання",
"00821":"Засобів вимірювальної техніки системи єдиного часу та еталонних частот",

"00827":"Інженерної, дорожньо-будівельної, мостобудівної, лісозаготівельної, інженерно-аеродромної техніки та майна",
"00828":"Мінно-вибухової техніки",
"00829":"Електротехнічних засобів",
"00830":"Техніки та майна радіаційного, хімічного, біологічного захисту",
"00831":"Засобів радіаційної, хімічної, біологічної розвідки та дозиметричного контролю",
"00832":"Повітрянодесантної техніки",
"00833":"Понтонних парків і переправно-десантних машин",

"00878":"Молодшого медичного персоналу",
"00879":"Молодших спеціалістів з медичною освітою",
"00880":"Медичного обладнання",

"00884":"Молодших ветеринарних спеціалістів",
"00885":"Молодших спеціалістів ветеринарної медицини",
"00886":"Службового собаківництва",
"00887":"Службових тварин (перевезення вантажів)",


"00900":"Бухгалтерського обліку",
"00901":"Діловодства",
"00902":"Креслярських і графічних робіт",
"00903":"Спеціального зв`язку (СПЗ)",
"00904":"Обробки інформації оборонного планування",
"00905":"Ремонту техніки спеціального зв`язку",
"00906":"Фізичної підготовки та спорту",
"00907":"Дорожньо-комендантської служби",
"00908":"Комендатур і контрольно-пропускних пунктів",
"00909":"Електронної апаратури кодування та спеціального зв`язку",
"00910":"Навчальних об`єктів полігонів",
"00911":"Фінансів",

"00912":"Клубів і бібліотек",
"00913":"Кінорадіотехнічні",
"00914":"Військової преси",
"00915":"Морально-психологічного забезпечення",

"00917":"Військових оркестрів, військових музичних центрів",
"00918":"Ансамблів і театрів",

"00922":"Друкарських робіт",
"00923":"Друку топографічних карт",
"00924":"Поліграфічних машин",
"00925":"Оперативної техніки",

"00929":"По роботі з військовослужбовцями, які проходять військову службу за контрактом",

"00932":"Правоохоронної діяльності",

"00937":"Колійних робіт",
"00938":"Колійних машин",
"00939":"Теслярсько-мостових і монтажно-мостових робіт",
"00940":"Складання та монтажу мостів з металоконструкцій",
"00941":"Палезабивних і копрових агрегатів",
"00942":"Залізничних, збірно-розбірних, консольних і плавучих кранів",
"00943":"Бурових, прохідницьких і породонавантажувальних машин",
"00944":"Залізничного водопостачання",
"00945":"Будівництва та ремонту автомобільних шляхів і аеродромів",
"00946":"Технічної розвідки залізниць",

"00948":"Служби руху",
"00949":"Локомотивної служби",
"00953":"Моторейкового транспорту",

"00956":"Будівельних робіт",
"00957":"Квартирно-експлуатаційної служби",
"00958":"Теплогазопостачання, вентиляції та кондиціювання",
"00959":"Холодильного обладнання та установок",
"00960":"Водопостачання та каналізації",
"00961":"Перекачувальних установок",
"00962":"Шахтових підйомників і ліфтів",
"00963":"Герметичнозахисних пристроїв спеціальних споруд",
"00964":"Ізоляційно-гудронаторних робіт",
"00965":"Фортифікаційних споруд",
"00966":"Служби пожежної безпеки",
"00967":"Пожежної охорони",

"00972":"Металопокриттів (крім покриттів лакофарбовими матеріалами та малярних робіт)",
"00974":"Налагодження та ремонту станкового обладнання",
"00975":"Ливарних робіт",
"00977":"Обробки полімерних матеріалів",

"00980":"Паросилових і котельних установок",
"00982":"Компресорних станцій (установок)",
"00983":"Газового аналізу та контролю",

"00992":"Спеціалісти секретного документального забезпечення",
"00993":"Спеціалісти протидії технічним розвідкам",
"00994":"Спеціалісти надання електронних довірчих послуг",

"00998":"Придатні до військової служби",
"00999":"Непридатні до військової служби у мирний час, обмежено придатні у воєнний час"}


import os
 
# assign directory
directory = '/home/olets/PycharmProjects/mrs/django/media/uploads/military_photos'
 
# iterate over files in
# that directory
user_photos = []
for root, dirs, files in os.walk(directory):
    for filename in files:
        user_photos.append('uploads/military_photos/'+filename)

class Command(BaseCommand):

    def handle(self, *args, **options):
        import random
        from django.utils.crypto import get_random_string
        from apps.mrs.models import MilitaryPerson, BloodGroup,Gender,MilitarySpecialty,FitnessDegree,DisabilityGroup,TCKEmployee, Company,CompanyEmployee,MilitaryPersonPhone,Child,MilitaryAccountingGroup
        from apps.core.models import CoreOrganization
        from faker import Faker
        fake = Faker('uk_UA')
        import datetime
        # for k in range(500):
        #     n_k = fake.company()
        #     c = Company()
        #     c.name = n_k
        #     c.full_name = n_k
        #     c.address = fake.address()
        #     c.edrpou = get_random_string(length=10, allowed_chars='0123456789')
        #     c.save()

    #    for name in TCK:
    #        CoreOrganization.objects.create(name=name,full_name=name,address=fake.street_address())
        # for key, value in SPC.items():
        #     m_s = MilitarySpecialty(code = key, title =value)
        #     m_s.save()
        # for i in range(20000):
        #     militaryes = []
        #     m={}
        #     for n in range(500):
        #         l = fake.last_name()
        #         p = MilitaryPerson()
        #         p.first_name=fake.first_name_male()
        #         p.last_name=l
        #         p.photo.name = random.choice(user_photos)
        #         p.father_last_name=l
        #         p.father_first_name =fake.first_name_male()
        #         p.mother_last_name = l
        #         p.mother_first_name = fake.first_name_female()
        #         p.spouse_first_name =  fake.first_name_female()
        #         p.spouse_last_name = l
        #         p.date_of_birth = datetime.datetime(random.randrange(1960, 2000), random.randrange(1,12), random.randrange(1,28))
        #         p.place_of_birth = fake.city()
        #         p.military_rank_id = random.randrange(1, 13)
        #         p.military_specialty_id = random.randrange(1, 516)
        #         p.residence_address = fake.address()
        #         p.current_address = fake.address()
        #         p.gender=Gender.M[0]
        #         p.blood_group=random.choice(BloodGroup.choices)[0]
        #         p.accounting_group=random.choice(MilitaryAccountingGroup.choices)[0]
        #         p.disability_group=random.choice(DisabilityGroup.choices)[0]
        #         p.health_status=random.choice(FitnessDegree.choices)[0]
        #         p.passport_series =  get_random_string(length=2, allowed_chars='АБВГДЕЄЖЗІК')
        #         p.passport_issue_date = datetime.datetime(random.randrange(1980, 2013), random.randrange(1,12), random.randrange(1,28))
        #         p.passport_number = get_random_string(length=6, allowed_chars='0123456789')
        #         p.taxpayer_id = get_random_string(length=10, allowed_chars='0123456789')
        #         p.passport_issuing_authority = fake.address()
        #         p.height = random.randrange(150, 220)
        #         p.weight = random.randrange(50, 130)
        #         p.arm_span = random.randrange(150, 200)
        #         p.leg_span = random.randrange(25, 56)
        #         p.chest_circumference = random.randrange(80, 120)
        #         p.waist_circumference = random.randrange(55, 120)
        #         p.hip_circumference = random.randrange(70, 120)
                
        #         militaryes.append(p)
        
        #     MilitaryPerson.objects.bulk_create(militaryes)

        #     militaryes=[]
        ccc=0
        t_l=[]
        c_e_l=[]
        p_l=[]
        mc_l=[]
        total = 0
        for n  in MilitaryPerson.objects.filter(id__gt = 6604716).iterator():
            for p in range(random.randrange(1,2)):
                t = TCKEmployee(military_person = n,
                            tck=CoreOrganization.objects.order_by('?')[0],
                            hired_date = datetime.datetime(random.randrange(1980, 2005), random.randrange(1,12), random.randrange(1,28)))  
                t_l.append(t)
            c_e = CompanyEmployee(military_person = n,
                                  company=Company.objects.order_by('?')[0],
                                  hired_date = datetime.datetime(random.randrange(2014, 2023), random.randrange(1,12), random.randrange(1,28)),
                                  position = fake.job())
            c_e_l.append(c_e)
            for p in range(random.randrange(1,2)):
                mp = MilitaryPersonPhone()
                mp.military_person = n
                mp.phone = fake.phone_number()
                p_l.append(mp)

            for c in range(random.randrange(0,4)):
                mc = Child()
                mc.military_person = n
                mc.first_name=fake.first_name()
                mc.last_name=n.last_name
                mc.date_of_birth= datetime.datetime(random.randrange(2014, 2023), random.randrange(1,12), random.randrange(1,28))
                mc_l.append(mc)

            if ccc>=400:
               TCKEmployee.objects.bulk_create(t_l)
               t_l = []
               CompanyEmployee.objects.bulk_create(c_e_l)
               c_e_l = []
               MilitaryPersonPhone.objects.bulk_create(p_l)
               p_l = []
               Child.objects.bulk_create(mc_l)
               mc_l=[]
               total = total+ccc
               ccc=0 
               print('insert 400')
               print(f'insert  total {total}')
            ccc+=1    
            
            
            


    
        
